# Narrative
# --------
# pr()
#
# Extracted from stzStringTest.ring, block #100.
#ERR exit 1: Error (S1) In file: 100_boxround.ring

load "../../stzBase.ring"

pr()

? BoxRound("SOFTANZA")
#-->
'
╭───┬───┬───┬───┬───┬───┬───┬───╮
│ S │ O │ F │ T │ A │ N │ Z │ A │
╰───┴───┴───┴───┴───┴───┴───┴───╯
'

? BoxRound(
	BoxRoundChars("SOFTANZA") + NL +
	BoxRound(Spacify("IS GREAT!")) + NL +
	"ACTUALLY, IT'S..." + NL +
	Box("AWOSME!")
)
#-->
'
╭───────────────────────────────────╮
│ ╭───┬───┬───┬───┬───┬───┬───┬───╮ │
│ │ S │ O │ F │ T │ A │ N │ Z │ A │ │
│ ╰───┴───┴───┴───┴───┴───┴───┴───╯ │
│       ╭───────────────────╮       │
│       │ I S   G R E A T ! │       │
│       ╰───────────────────╯       │
│         ACTUALLY, IT'S...         │
│            ┌─────────┐            │
│            │ AWOSME! │            │
│            └─────────┘            │
╰───────────────────────────────────╯
'

pf()
# Executed in 0.06 second(s) in Ring 1.23
