# Narrative
# --------
# pr()
#
# Extracted from stzStringTest.ring, block #907.
#ERR Error (R11) : Error in class name, class not found: stzlistofchars

load "../../stzBase.ring"

pr()

o1 = new stzListOfChars([ "S", "O", "F", "T", "A", "N", "Z", "A" ])
? o1.BoxifiedXT([ :Round = TRUE ])
#-->
# ╭───┬───┬───┬───┬───┬───┬───┬───╮
# │ S │ O │ F │ T │ A │ N │ Z │ A │
# ╰───┴───┴───┴───┴───┴───┴───┴───╯

? o1.BoxifiedXT([ :Corners = [ :Round, :Rect, :Round, :Rect ] ])
#-->
# ╭───┬───┬───┬───┬───┬───┬───┬───┐
# │ S │ O │ F │ T │ A │ N │ Z │ A │
# └───┴───┴───┴───┴───┴───┴───┴───╯

pf()
# Executed in 0.04 second(s).
