# Narrative
# --------
# pr()
#
# Extracted from stzStringTest.ring, block #938.

load "../../stzBase.ring"

pr()

o1 = new stzString("SOFTANZA~RING")

o1.BoxifyCharsXT([
	:Rounded = TRUE,
	:Corners = [ :Round, :Rect, :Round, :Rect ],
	:Numbered = TRUE
])

? o1.Content() + NL
#-->
# ╭───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┐
# │ S │ O │ F │ T │ A │ N │ Z │ A │ ~ │ R │ I │ N │ G │
# └───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───╯
#   1   2   3   4   5   6   7   8   9   10  11  12  13

# When you define :Rounded = FALSE, the ouput is not rounded,
# even if the :Corners are defined:

o1 = new stzString("SOFTANZA~RING")

o1.BoxifyCharsXT([
	:Rounded = FALSE,
	:Corners = [ :Round, :Rect, :Round, :Rect ],
	:Numbered = TRUE
])

? o1.Content()
#-->
# ┌───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┐
# │ S │ O │ F │ T │ A │ N │ Z │ A │ ~ │ R │ I │ N │ G │
# └───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┘
#   1   2   3   4   5   6   7   8   9   10  11  12  13

pf()
# Executed in 0.12 second(s) in Ring 1.22
