# Narrative
# --------
# pr()
#
# Extracted from stzStringTest.ring, block #973.

load "../../stzBase.ring"

pr()

o1 = new stzListOfChars( @Chars("fjringljringdjringg") )
aOptions = [
	[ "rounded", 1 ],
	[ "sectioned", 1 ],
	[ "numbered", 1 ],
	[ "hilighted", [ 3, 6, 9, 12, 15, 18 ] ],
	[ "casesensitive", 1 ]
]

? o1.BoxXT(aOptions)
#-->
# ╭───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───╮
# │ f │ j │ r │ i │ n │ g │ l │ j │ r │ i │ n │ g │ d │ j │ r │ i │ n │ g │ g │
# ╰───┴───┴─•─┴───┴───┴─•─┴───┴───┴─•─┴───┴───┴─•─┴───┴───┴─•─┴───┴───┴─•─┴───╯
#          '-----------'           '-----------'           '-----------'
#          3           6           9         12            15         18

pf()
