# Narrative
# --------
# pr()
#
# Extracted from stzStringTest.ring, block #99.
#ERR Error (R3) : Calling Function without definition: eachcharboxrounded

load "../../stzBase.ring"

pr()

Q("PROGRAMMING") {

   ? Boxed()

   ? BoxedRound()

   ? EachCharBoxed()

   ? EachCharBoxRounded()

}

pf()
# Executed in 0.07 second(s) in Ring 1.23
#-->
# ┌─────────────┐
# │ PROGRAMMING │
# └─────────────┘
# ╭─────────────╮
# │ PROGRAMMING │
# ╰─────────────╯
# ┌───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┐
# │ P │ R │ O │ G │ R │ A │ M │ M │ I │ N │ G │
# └───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┘
# ╭───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───╮
# │ P │ R │ O │ G │ R │ A │ M │ M │ I │ N │ G │
# ╰───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───╯
