# Narrative
# --------
# Testing moving and hitting an obstacle
#
# Extracted from stzGridTest.ring, block #22.

load "../../../stzBase.ring"

pr()

o1 = new stzGrid([10, 6])

# Create some obstacles to form regions
o1.AddObstacles([
	[3, 1],
	[3, 2],
	[3, 3],
	[3, 4],
	[3, 6],

	[7, 1],
	[7, 2],
	[7, 3],
	[7, 4],
	[7, 5],
	[7, 6]
])

o1.Show()
#-->
#     1 2 3 4 5 6 7 8 9 0 
#   ╭─v───────────────────╮
# 1 > x . ■ . . . . . . . │
# 2 │ . . ■ . . . ■ . . . │
# 3 │ . . ■ . . . ■ . . . │
# 4 │ . . ■ . . . ■ . . . │
# 5 │ . . . . . . ■ . . . │
# 6 │ . . . . . . ■ . . . │
#   ╰─────────────────────╯

o1.MoveRight()
o1.MoveDown()
o1.MoveDown()
o1.Show()
#-->
#     1 2 3 4 5 6 7 8 9 0 
#   ╭─v───────────────────╮
# 1 > . . ■ . . . . . . . │
# 2 │ . . ■ . . . ■ . . . │
# 3 │ . x ■ . . . ■ . . . │
# 4 │ . . ■ . . . ■ . . . │
# 5 │ . . . . . . ■ . . . │
# 6 │ . . . . . . ■ . . . │
#   ╰─────────────────────╯

o1.MoveRight() # Won't move, hitted an obstacle.
? @@( o1.Position() )
#--> [2, 3]

pf()
# Executed in almost 0 second(s) in Ring 1.22
