# Narrative
# --------
# pr()
#
# Extracted from stzlistofcharstest.ring, block #1.

load "../../../stzBase.ring"


o1 = new stzListOfChars([ 945, 946, 947 ])

? @@( o1.Content() ) + NL
#--> [ "α", "β", "γ" ]

? @@( Unicodes([ "α", "β", "γ" ]) ) + NL
#--> [ 945, 946, 947 ]

? @@( MathChars() )
#--> [
#	"¬", "°", "±", "¼", "½", "¾", "×", "÷",
#	"Γ", "Δ", "Θ", "Λ", "Ξ", "Π", "Σ", "Υ",
#	"Φ", "Ψ", "Ω", "α", "β", "γ", "δ", "ε",
#	"ζ", "η", "θ", "ι", "κ", "λ", "μ", "ν",
#	"ξ", "ο", "π", "ρ", "σ", "τ", "υ", "φ",
#	"χ", "ψ", "ω", "⅓", "⅔", "∀", "∂", "∃",
#	"∅", "∇", "∈", "∉", "∏", "∑", "√",
#	"∝", "∞", "∠", "∧", "∨", "∫", "∲", "∴",
#	"≈", "≠", "≡", "≤", "≥"
# ]

pf()
#--> Executed in 0.08 second(s)
